Revit 2024 API
PlanViewPlane Enumeration
 Locations where view range offsets can be specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum PlanViewPlane
Visual Basic
Public Enumeration PlanViewPlane
Visual C++
public enum class PlanViewPlane
Members
Member name | Description
CutPlane |  Cut Plane
TopClipPlane |  Top Clip Plane
BottomClipPlane |  Bottom Clip Plane
ViewDepthPlane |  View Depth Plane
UnderlayBottom |  Underlay Bottom Plane
See Also
Autodesk.Revit.DB Namespace